import pandas as pd
import pytest


@pytest.fixture
def fixture_dataframe_with_one_operation() -> pd.DataFrame:
    df_one_operation = pd.DataFrame(
        {
            "Дата операции": ["31.12.2021 16:44:00"],
            "Дата платежа": ["31.12.2021"],
            "Номер карты": ["*7197"],
            "Статус": ["OK"],
            "Сумма операции": ["-160,89"],
            "Валюта операции": ["RUB"],
            "Сумма платежа": ["-160,89"],
            "Валюта платежа": ["RUB"],
            "Кэшбэк": [None],
            "Категория": ["Супермаркеты"],
            "MCC": ["5411"],
            "Описание": ["Колхоз"],
            "Бонусы (включая кэшбэк)": ["3,00"],
            "Округление на инвесткопилку": ["0,00"],
            "Сумма операции с округлением": ["160,89"],
        }
    )
    return df_one_operation
